{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 128, 128, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "Conv1_pad", "config": {"name": "Conv1_pad", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "Conv1", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [2, 2], "filters": 32, "name": "Conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]]}, {"name": "bn_Conv1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "bn_Conv1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"name": "Conv1_relu", "config": {"name": "Conv1_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise", "config": {"depthwise_regularizer": null, "name": "expanded_conv_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "expanded_conv_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_relu", "config": {"name": "expanded_conv_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 16, "name": "expanded_conv_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "expanded_conv_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"name": "block_1_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 96, "name": "block_1_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]]}, {"name": "block_1_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_1_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]]}, {"name": "block_1_expand_relu", "config": {"name": "block_1_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]]}, {"name": "block_1_pad", "config": {"name": "block_1_pad", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]]}, {"name": "block_1_depthwise", "config": {"depthwise_regularizer": null, "name": "block_1_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [2, 2], "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]]}, {"name": "block_1_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_1_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]]}, {"name": "block_1_depthwise_relu", "config": {"name": "block_1_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]]}, {"name": "block_1_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 24, "name": "block_1_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]]}, {"name": "block_1_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_1_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0, {}]]]}, {"name": "block_2_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 144, "name": "block_2_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]]}, {"name": "block_2_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_2_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]]}, {"name": "block_2_expand_relu", "config": {"name": "block_2_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]]}, {"name": "block_2_depthwise", "config": {"depthwise_regularizer": null, "name": "block_2_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]]}, {"name": "block_2_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_2_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]]}, {"name": "block_2_depthwise_relu", "config": {"name": "block_2_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]]}, {"name": "block_2_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 24, "name": "block_2_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]]}, {"name": "block_2_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_2_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0, {}]]]}, {"name": "block_2_add", "config": {"name": "block_2_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]]}, {"name": "block_3_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 144, "name": "block_3_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0, {}]]]}, {"name": "block_3_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_3_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]]}, {"name": "block_3_expand_relu", "config": {"name": "block_3_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]]}, {"name": "block_3_pad", "config": {"name": "block_3_pad", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]]}, {"name": "block_3_depthwise", "config": {"depthwise_regularizer": null, "name": "block_3_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [2, 2], "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]]}, {"name": "block_3_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_3_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]]}, {"name": "block_3_depthwise_relu", "config": {"name": "block_3_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]]}, {"name": "block_3_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 32, "name": "block_3_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]]}, {"name": "block_3_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_3_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0, {}]]]}, {"name": "block_4_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 192, "name": "block_4_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]]}, {"name": "block_4_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_4_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]]}, {"name": "block_4_expand_relu", "config": {"name": "block_4_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]]}, {"name": "block_4_depthwise", "config": {"depthwise_regularizer": null, "name": "block_4_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]]}, {"name": "block_4_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_4_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]]}, {"name": "block_4_depthwise_relu", "config": {"name": "block_4_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]]}, {"name": "block_4_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 32, "name": "block_4_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]]}, {"name": "block_4_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_4_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0, {}]]]}, {"name": "block_4_add", "config": {"name": "block_4_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]]}, {"name": "block_5_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 192, "name": "block_5_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0, {}]]]}, {"name": "block_5_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_5_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]]}, {"name": "block_5_expand_relu", "config": {"name": "block_5_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]]}, {"name": "block_5_depthwise", "config": {"depthwise_regularizer": null, "name": "block_5_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]]}, {"name": "block_5_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_5_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]]}, {"name": "block_5_depthwise_relu", "config": {"name": "block_5_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]]}, {"name": "block_5_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 32, "name": "block_5_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]]}, {"name": "block_5_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_5_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0, {}]]]}, {"name": "block_5_add", "config": {"name": "block_5_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]]}, {"name": "block_6_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 192, "name": "block_6_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_5_add", 0, 0, {}]]]}, {"name": "block_6_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_6_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]]}, {"name": "block_6_expand_relu", "config": {"name": "block_6_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]]}, {"name": "block_6_pad", "config": {"name": "block_6_pad", "data_format": "channels_last", "trainable": true, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]]}, {"name": "block_6_depthwise", "config": {"depthwise_regularizer": null, "name": "block_6_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [2, 2], "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]]}, {"name": "block_6_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_6_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]]}, {"name": "block_6_depthwise_relu", "config": {"name": "block_6_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]]}, {"name": "block_6_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 64, "name": "block_6_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]]}, {"name": "block_6_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_6_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_project", 0, 0, {}]]]}, {"name": "block_7_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 384, "name": "block_7_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]]}, {"name": "block_7_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_7_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]]}, {"name": "block_7_expand_relu", "config": {"name": "block_7_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]]}, {"name": "block_7_depthwise", "config": {"depthwise_regularizer": null, "name": "block_7_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]]}, {"name": "block_7_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_7_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]]}, {"name": "block_7_depthwise_relu", "config": {"name": "block_7_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]]}, {"name": "block_7_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 64, "name": "block_7_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]]}, {"name": "block_7_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_7_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_project", 0, 0, {}]]]}, {"name": "block_7_add", "config": {"name": "block_7_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]]}, {"name": "block_8_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 384, "name": "block_8_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_7_add", 0, 0, {}]]]}, {"name": "block_8_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_8_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]]}, {"name": "block_8_expand_relu", "config": {"name": "block_8_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]]}, {"name": "block_8_depthwise", "config": {"depthwise_regularizer": null, "name": "block_8_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]]}, {"name": "block_8_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_8_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]]}, {"name": "block_8_depthwise_relu", "config": {"name": "block_8_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]]}, {"name": "block_8_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 64, "name": "block_8_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]]}, {"name": "block_8_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_8_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_project", 0, 0, {}]]]}, {"name": "block_8_add", "config": {"name": "block_8_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]]}, {"name": "block_9_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 384, "name": "block_9_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_8_add", 0, 0, {}]]]}, {"name": "block_9_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_9_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]]}, {"name": "block_9_expand_relu", "config": {"name": "block_9_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]]}, {"name": "block_9_depthwise", "config": {"depthwise_regularizer": null, "name": "block_9_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]]}, {"name": "block_9_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_9_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]]}, {"name": "block_9_depthwise_relu", "config": {"name": "block_9_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]]}, {"name": "block_9_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 64, "name": "block_9_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]]}, {"name": "block_9_project_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_9_project_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_project", 0, 0, {}]]]}, {"name": "block_9_add", "config": {"name": "block_9_add", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]]}, {"name": "block_10_expand", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 384, "name": "block_10_expand", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block_9_add", 0, 0, {}]]]}, {"name": "block_10_expand_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_10_expand_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]]}, {"name": "block_10_expand_relu", "config": {"name": "block_10_expand_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]]}, {"name": "block_10_depthwise", "config": {"depthwise_regularizer": null, "name": "block_10_depthwise", "kernel_size": [3, 3], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depth_multiplier": 1, "bias_constraint": null, "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "use_bias": false, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]]}, {"name": "block_10_depthwise_BN", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "block_10_depthwise_BN", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]]}, {"name": "block_10_depthwise_relu", "config": {"name": "block_10_depthwise_relu", "max_value": 6.0, "threshold": 0.0, "trainable": true, "negative_slope": 0.0}, "class_name": "ReLU", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]]}, {"name": "block_10_project", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "filters": 96, "name": "block_10_project", "bias_initializer": {"class_name": "Zeros", "config": {}}, 